---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.IsPanelScheduleTemplate
source: html/77fe7249-7ce9-7f81-0a49-58ae007e4ce8.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.IsPanelScheduleTemplate Method

Check if this is a panel schedule template.

## Syntax (C#)
```csharp
public bool IsPanelScheduleTemplate()
```

## Returns
Check if this is a panel schedule template.